# --- Homebrew 設定 ---
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# --- 1. 開發工具 (CLI) ---
brew "git"
brew "node"             # 包含 npm
brew "pnpm"
brew "mas"              # Mac App Store 命令行工具

# --- 2. 應用程式 (Cask) ---
# 開發類
cask "visual-studio-code"
cask "docker"
cask "postman"
cask "android-studio"
cask "google-cloud-sdk" # gcloud

# 工具類
cask "google-chrome"
cask "snipaste"         # 截圖神器
cask "calibre"          # 電子書管理

# 辦公與溝通
cask "microsoft-word"
cask "microsoft-excel"
cask "zoom"

# --- 3. 字型 (美化 Terminal 用) ---
cask "font-fira-code"       # 寫程式推薦
cask "font-hack-nerd-font"  # Terminal 圖示支援 (Dracula 主題建議)
